新增API文档跟连接
